In [9]:
import pandas as  pd

In [23]:
#engg = pd.read_csv('data/Engineering - Student.csv')
pd.read_csv("D:\\prac.csv")
#sciene = pd.read_csv('data/Science - Student.csv')
#science = pd.read_csv('Science - Student.csv')
#exam = pd.read_csv('data/Test - Info.csv')
#student_exam = pd.read_csv('data/Student - Exam - Info.csv')
#exam = pd.read_csv('Test - Info.csv')
#student_exam = pd.read_csv('Student - Exam - Info.csv')

   Student_id First_name Last_name
0   180105015       kkkk      cccc
1   180105004       aaaa       vvv
2   180105009       DDDd       hhh
3   180105029       SSSS      PPPP
4   180105033       Yuuu      Ssss
5   180105016      Nmnnn      yyyy
6   180105034      ssssa      iiii

In [22]:
pd.read_csv("D:\\prac2.csv")

   Student_id  Marks
0   180105016     75
1   180105015     65
2   180105034     65
3   180105004     85
4   180105029     65
5   180105033     56
6   180105009     62

In [20]:
df = pd.read_csv("D:\\prac.csv")
df1 = pd.read_csv("D:\\prac2.csv")
df2 =df.merge(df1 ,how= 'outer',on = 'Student_id')
print(df2)

   Student_id First_name Last_name  Marks
0   180105015       kkkk      cccc     65
1   180105004       aaaa       vvv     85
2   180105009       DDDd       hhh     62
3   180105029       SSSS      PPPP     65
4   180105033       Yuuu      Ssss     56
5   180105016      Nmnnn      yyyy     75
6   180105034      ssssa      iiii     65

In [21]:
df = pd.read_csv("D:\\prac.csv")
df1 = pd.read_csv("D:\\prac2.csv")
df2 = pd.concat([df,df1],axis =1)
print(df2)

   Student_id First_name Last_name  Student_id  Marks
0   180105015       kkkk      cccc   180105016     75
1   180105004       aaaa       vvv   180105015     65
2   180105009       DDDd       hhh   180105034     65
3   180105029       SSSS      PPPP   180105004     85
4   180105033       Yuuu      Ssss   180105029     65
5   180105016      Nmnnn      yyyy   180105033     56
6   180105034      ssssa      iiii   180105009     62